Runhui-Wang/EFM32GG11_FileSys/file_system_upgrade/cli.c
/***************************************************************************//**
 * @file
 * @brief cli micrium os kernel examples functions
 *******************************************************************************
 * # License
 * <b>Copyright 2020 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * The licensor of this software is Silicon Laboratories Inc. Your use of this
 * software is governed by the terms of Silicon Labs Master Software License
 * Agreement (MSLA) available at
 * www.silabs.com/about-us/legal/master-software-license-agreement. This
 * software is distributed to you in Source Code format and is governed by the
 * sections of the MSLA applicable to Source Code.
 *
 ******************************************************************************/
#include <string.h>
#include <stdio.h>
#include "cli.h"
#include "sl_cli.h"
#include "sl_cli_instances.h"
#include "sl_cli_arguments.h"
#include "sl_cli_handles.h"
#include "sl_simple_led.h"
#include "sl_simple_led_instances.h"
#include "os.h"
#include "btl_interface.h"
#include "sdio.h"
#include "em_adc.h"
#include "mod_fatfs_chan.h"
#include "unit_test.h"
/*******************************************************************************
 *******************************   DEFINES   ***********************************
 ******************************************************************************/
static uint32_t rxDataReady = 0;  // Flag indicating receiver does not have data
static volatile char rxBuffer[20]; // Software receive buffer
static char txBuffer[20]; // Software transmit buffer
char read_buffer[30];
int read_request_bytes = 30;
unsigned int read_bytes_recieved = 0;
unsigned int file_num = 0;
static sl_sleeptimer_timer_handle_t periodic_timer;
#define TIMEOUT_MS 2
#define adcFreq         16000000
uint32_t sample;
uint32_t millivolts;
void
ADC_tas ();
uint64_t tick_cnt = 0;
uint64_t timestamp;
sl_status_t stat;
int retval = 0;
int total_bytes_written;
int write_request_bytes;
int write_bytes_written;
RTOS_ERR RT_ERR;
OS_TCB ADC_TaskTCB;
OS_TASK_PTR ADC_task;
#define   ADC_TASK_STK_SIZE 256u
#define RX_BUFFER_SIZE 20
CPU_STK ADC_TaskStk[ADC_TASK_STK_SIZE];
;
FIL superfile;
uint64_t time_offset = 0;
uint32_t data_entries = 0;
uint64_t new_time;
uint64_t new_tick_cnt;
uint64_t descrep;
int reach_flag = 0;
int testing_flag =0;

/*******************************************************************************
 *******************************   DEFINES   ***********************************
 ******************************************************************************/

#ifndef BUFSIZE
#define BUFSIZE    80
#endif

#ifndef TERMINAL_TASK_STACK_SIZE
#define TERMINAL_TASK_STACK_SIZE      256
#endif

#ifndef TERMINAL_TASK_PRIO
#define TERMINAL_TASK_PRIO            20
#endif
#define CLI_DEMO_TASK_STACK_SIZE     256
#define CLI_DEMO_TASK_PRIO            15
FIL superfile;
uint32_t bytes_read;
char file_name[] = "ADC_Data_0000.txt";


struct adc_data
{
  uint64_t t_stamp;
  uint32_t voltage;
};

struct adc_data *cirbuff;
int front = 0;
int back = 160;
//uint8_t* buffer_t;
volatile uint8_t buffer_t[52100];
#define BTL_PARSER_CTX_SZ  0x200
static uint8_t parserContext[BTL_PARSER_CTX_SZ];
static BootloaderParserCallbacks_t parserCallbacks;
uint32_t total_bytes = 0;
OS_TMR  App_Timer;
#define MIN(a, b) (((a) < (b)) ? (a) : (b))
static OS_TCB tcb;
static CPU_STK stack[TERMINAL_TASK_STACK_SIZE];

/* Input buffer */
static char buffer[BUFSIZE];
void
app_iostream_terminal_task (void *arg);
/*******************************************************************************
 *********************   LOCAL FUNCTION PROTOTYPES   ***************************
 ******************************************************************************/

void echo_str(sl_cli_command_arg_t *arguments);
void echo_int(sl_cli_command_arg_t *arguments);
void led_cmd();
void ls_cmd(sl_cli_command_arg_t *arguments);
void mk_dir(sl_cli_command_arg_t *arguments);
void rm_cmd(sl_cli_command_arg_t *arguments);
void mv_cmd(sl_cli_command_arg_t *arguments);
void enable_sd(sl_cli_command_arg_t *arguments);
void exit_sd();
void cd_cmd(sl_cli_command_arg_t *arguments);
void pwd_cmd();
void adc_cmd (sl_cli_command_arg_t *arguments);
void pause_cmd();
void unit_test();
void cp_cmd(sl_cli_command_arg_t *arguments);
/*******************************************************************************
 ***************************  LOCAL VARIABLES   ********************************
 ******************************************************************************/

static const sl_cli_command_info_t cmd__echostr = \
  SL_CLI_COMMAND(echo_str,
                 "echoes string arguments to the output",
                 "No argument",
                 {  SL_CLI_ARG_END, });

static const sl_cli_command_info_t cmd__echoint = \
  SL_CLI_COMMAND(echo_int,
                 "echoes integer arguments to the output",
                 "No argument",
                 {  SL_CLI_ARG_END, });

static const sl_cli_command_info_t cmd__led = \
  SL_CLI_COMMAND(led_cmd,
                 "Change an led status",
                 "Nothing",
                 { SL_CLI_ARG_END, });

static const sl_cli_command_info_t cmd__ls = \
  SL_CLI_COMMAND(ls_cmd,
                 "Print everything under current directory",
                 "Optional: flag"SL_CLI_UNIT_SEPARATOR "Optional: file path",
                 {  SL_CLI_ARG_WILDCARD,SL_CLI_ARG_END, });

static const sl_cli_command_info_t cmd__mkdir = \
  SL_CLI_COMMAND(mk_dir,
                 "Create a new Directory",
                 "Directory Name",
                 {  SL_CLI_ARG_WILDCARD,SL_CLI_ARG_END, });

static const sl_cli_command_info_t cmd__rm = \
  SL_CLI_COMMAND(rm_cmd,
                 "delete a Directory/File",
                 "Directory/File Name",
                 {  SL_CLI_ARG_WILDCARD,SL_CLI_ARG_END, });
static const sl_cli_command_info_t cmd__mv = \
  SL_CLI_COMMAND(mv_cmd,
                 "Rename a File",
                 "old File Name"SL_CLI_UNIT_SEPARATOR"new File Name/directory",
                 {SL_CLI_ARG_STRING, SL_CLI_ARG_STRING, SL_CLI_ARG_END, });

