Runhui-Wang/EFM32GG11_FileSys/file_system_upgrade/cli.c
static const sl_cli_command_info_t cmd__sd = \
  SL_CLI_COMMAND(enable_sd,
                 "Enable SD CLI Commands",
                 "Optional SD commands",
                 { SL_CLI_ARG_WILDCARD,SL_CLI_ARG_END, });
static const sl_cli_command_info_t cmd__exit = \
  SL_CLI_COMMAND(exit_sd,
                 "Disable SD CLI Commands",
                 "None",
                 { SL_CLI_ARG_END, });
static const sl_cli_command_info_t cmd__cd = \
  SL_CLI_COMMAND(cd_cmd,
                 "Change Directory",
                 "Directory to change to",
                 { SL_CLI_ARG_STRINGOPT,SL_CLI_ARG_END, });
static const sl_cli_command_info_t cmd__pwd = \
  SL_CLI_COMMAND(pwd_cmd,
                 "Print out Current Working Directory",
                 "Directory to change to",
                 { SL_CLI_ARG_END, });
static const sl_cli_command_info_t cmd__adc = \
  SL_CLI_COMMAND(adc_cmd,
                 "Start ADC with Optional Time Offset",
                 "Optional Time Offset",
                 { SL_CLI_ARG_INT32OPT,SL_CLI_ARG_END, });
static const sl_cli_command_info_t cmd__pause = \
    SL_CLI_COMMAND(pause_cmd,
                     "Stop ADC",
                     "None",
                     {SL_CLI_ARG_END, });
static const sl_cli_command_info_t cmd__test = \
    SL_CLI_COMMAND(unit_test,
                     "Unit Testing",
                     "None",
                     {SL_CLI_ARG_END, });
static const sl_cli_command_info_t cmd__cp = \
    SL_CLI_COMMAND(cp_cmd,
                     "make a copy of file or directory",
                     "Original File"SL_CLI_UNIT_SEPARATOR"new File Name",
                     {SL_CLI_ARG_STRING,SL_CLI_ARG_STRING,SL_CLI_ARG_END, });
static sl_cli_command_entry_t a_table[] = {
  { "bootload_uart", &cmd__echostr,false },
  { "bootload_sd", &cmd__echoint, false },
  { "led", &cmd__led, false },
  { "set_time", &cmd__adc, false },
  {"pause", &cmd__pause,false},
  { "sd", &cmd__sd,false},
  {"test", &cmd__test,false},
  { NULL, NULL, false },
};
static sl_cli_command_entry_t b_table[] = {
  {"cd",&cmd__cd,false},
  {"ls", &cmd__ls,false},
  {"mkdir", &cmd__mkdir,false},
  {"rm", &cmd__rm,false},
  {"mv", &cmd__mv, false},
  {"exit", &cmd__exit,false},
  {"pwd", &cmd__pwd,false},
  {"cp", &cmd__cp,false},
  { NULL, NULL, false },
};
static sl_cli_command_group_t a_group = {
  { NULL },
  false,
  a_table
};
static sl_cli_command_group_t b_group = {
  { NULL },
  false,
  b_table
};
/*******************************************************************************
 *************************  EXPORTED VARIABLES   *******************************
 ******************************************************************************/

sl_cli_command_group_t *command_group = &a_group;
sl_cli_command_group_t *sd_group = &b_group;
/*******************************************************************************
 *************************   LOCAL FUNCTIONS   *********************************
 ******************************************************************************/
void  App_TimerCallback (void  *p_tmr,
                         void  *p_arg)
{
    /* Called when timer expires:                            */
    /*   'p_tmr' is pointer to the user-allocated timer.     */
    /*   'p_arg' is argument passed when creating the timer. */
  printf("Failed to Mount. Check SD card Presence!!!!\n");
  NVIC_SystemReset();
}
/***************************************************************************//**
 * bootload_uart
 *
 * bootload from uart terminal command and xmodem file transfer
 ******************************************************************************/
void echo_str(sl_cli_command_arg_t *arguments)
{
  bootloader_init();
  bootloader_eraseStorageSlot(0); // Have to erase the slot in order to enter uart mode if slot preoccupied.
  bootloader_rebootAndInstall();
}
#define MAX_METADATA_LENGTH   512
uint8_t metadata[MAX_METADATA_LENGTH];

void metadataCallback(uint32_t address, uint8_t *data, size_t length, void *context)
{
    uint8_t i;

    for (i = 0; i < MIN(length , MAX_METADATA_LENGTH - address); i++)
    {
        metadata[address + i] = data[i];
    }
}
/***************************************************************************//**
 * bootload_sd
 *
 * Bootload from a upgrade .gbl file on sd card
 ******************************************************************************/
void echo_int(sl_cli_command_arg_t *arguments)
{
  int32_t flag; //flag for bootloader
  BootloaderStorageSlot_t info_s; // info pointer for bootloader
  FRESULT retval; //return value for FAT FS
  uint32_t remain_bytes = 51200; //Byte Upper Limit for file

  memset(buffer_t,0,51200); //initialize the buffer with 0
  char file_name[] = "new_checker.gbl";//"new_checker.gbl"; // name of the file
  retval = f_open (&superfile, file_name,
                            FA_READ); //open the file
  if(retval!=FR_OK){
      printf("ERROR!!!ERROR!!!\n"); //Error Opening the file
  }
  printf("retval: %d\n",retval);
  int i=0;
  while(remain_bytes>0){//Read the file incrementally as FAT-FS can't handle all at once
      retval = f_read(&superfile,buffer_t+64*i,64,&bytes_read);

      total_bytes+=bytes_read;
      remain_bytes-=bytes_read;
      if(bytes_read==0){
          break;
      }
      i++;
  }
  if(retval!=FR_OK){
      printf("ERROR!!!ERROR!!!\n");
  }
  printf("bytes_read: %d\n",total_bytes);//Check with size of file
  flag=bootloader_init(); //init the bootloader
  printf("Init: %d\n",flag);


  bootloader_getStorageSlotInfo(0,&info_s); //get the storage info !not important

  flag=bootloader_eraseWriteStorage(0,0,buffer_t,total_bytes); // Erase the storage and start writing all into storage
  printf("Write Storage: %d\n",flag);

  if(bootloader_storageIsBusy()){
      osDelay(10);  //make sure it is done
  }
  bootloader_getStorageSlotInfo(0,&info_s); // Get the storage info !not important

   flag = bootloader_verifyImage(0,NULL); // Verify the image in the storage
   printf("Verify Image: %d\n",flag);


   bool flag_v = bootloader_verifyApplication(0x100000); // verify app
   printf("Verify App: %d\n",flag_v);


   flag=bootloader_setImageToBootload(0); // Select slot 0 as the place to run and reboot.
   printf("Set Image: %d\n",flag);





   osDelay(10);
  bootloader_rebootAndInstall();//reboot and start the new program.
}

/***************************************************************************//**
 * Callback for the led
 *
 * This function is used as a callback when the led command is called
 * in the cli. The command is used to turn on, turn off and toggle leds.
 ******************************************************************************/
void led_cmd()
{
  testing_flag =1;
}
void ls_cmd(sl_cli_command_arg_t *arguments){
  char* close = sl_cli_get_argument_string(arguments,0);
  char* patha = "";
  if(2==sl_cli_get_argument_count(arguments)){
      close = sl_cli_get_argument_string(arguments,0);
      patha = sl_cli_get_argument_string(arguments,1);
      if(0==strcmp(close,"-h")){
          fs_ls_cmd_f(2,patha);
      }else if(0==strcmp(close,"-l")){
          fs_ls_cmd_f(1,patha);
      }else if(0==strcmp(close,"-1")){
          fs_ls_cmd_f(0,patha);
      }else if( *close == '-'){
          printf("unrecognized command!!!\n");
      }
  }else if(1==sl_cli_get_argument_count(arguments)&&*close == '-'){
      close = sl_cli_get_argument_string(arguments,0);
      if(0==strcmp(close,"-h")){
          fs_ls_cmd_f(2,patha);
      }else if(0==strcmp(close,"-l")){
          fs_ls_cmd_f(1,patha);
      }else if(0==strcmp(close,"-1")){
          fs_ls_cmd_f(0,patha);
      }else if( *close == '-'){
          printf("unrecognized command!!!\n");
      }

  }else if (1==sl_cli_get_argument_count(arguments)&&*close != '-'){

      patha = sl_cli_get_argument_string(arguments,0);
      fs_ls_cmd_f(0,patha);

  }else if (0 == sl_cli_get_argument_count(arguments)){
      fs_ls_cmd_f(0,patha);
  }else{
      printf("Unrecognized Parameters!\n");
  }

  if(testing_flag==0){
      printf("SD");
  }

