Runhui-Wang/EFM32GG11_FileSys/file_system_upgrade/cli.c
}
void mk_dir(sl_cli_command_arg_t *arguments){
  char* close;
  close = sl_cli_get_argument_string(arguments,0);
  fs_mkdir_cmd_f(close);
  if(testing_flag==0){
      printf("SD");
  }

}
void rm_cmd(sl_cli_command_arg_t *arguments){
  char* close;
  close = sl_cli_get_argument_string(arguments,0);
  fs_rm_cmd_f(close);
  if(testing_flag==0){
      printf("SD");
  }

}
void mv_cmd(sl_cli_command_arg_t *arguments){
  char* n_name;
  char* o_name;
  n_name =  sl_cli_get_argument_string(arguments,1);
  o_name = sl_cli_get_argument_string(arguments,0);
  fs_mv_cmd_f(o_name,n_name);
  if(testing_flag==0){
      printf("SD");
  }

}
void enable_sd(sl_cli_command_arg_t *arguments){
  RTOS_ERR     err;
  CPU_BOOLEAN  deleted;
  CPU_BOOLEAN  stopped;
  CPU_BOOLEAN  started;
  int tmp_flag_pr =0;
  OSTmrCreate(&App_Timer,            /*   Pointer to user-allocated timer.     */
                  "App Timer",           /*   Name used for debugging.             */
                     100,                  /*     0 initial delay.                   */
                   0,                  /*   100 Timer Ticks period.              */
                   OS_OPT_TMR_ONE_SHOT ,  /*   Timer is periodic.                   */
                  &App_TimerCallback,    /*   Called when timer expires.           */
                   DEF_NULL,             /*   No arguments to callback.            */
                  &err);
  OSTimeDly( 10,              /*   Delay the task for 100 OS Ticks.         */
               OS_OPT_TIME_DLY,  /*   Delay is relative to current time.       */
              &err);
  started = OSTmrStart(&App_Timer,  /*   Pointer to user-allocated timer.      */
                       &err);
  OSTimeDly( 10,              /*   Delay the task for 100 OS Ticks.         */
               OS_OPT_TIME_DLY,  /*   Delay is relative to current time.       */
              &err);
  if (err.Code != RTOS_ERR_NONE) {
      printf("Error in Timer");
  }

  fs_bsp_init (); //SD Card Set-up
  stopped = OSTmrStop(&App_Timer,        /*   Pointer to user-allocated timer. */
                        OS_OPT_TMR_NONE,  /*   Do not execute callback.         */
                        DEF_NULL,         /*   No arguments to callback.        */
                       &err);
   if (err.Code != RTOS_ERR_NONE) {
       printf("Error in Timer");
   }
  deleted = OSTmrDel(&App_Timer,  /*   Pointer to user-allocated timer.        */
                        &err);
     if (err.Code != RTOS_ERR_NONE) {
         printf("Error in Timer");
     }
  bool status;
  status = sl_cli_command_add_command_group(sl_cli_inst_handle, sd_group);
  EFM_ASSERT(status);
  status = sl_cli_command_remove_command_group(sl_cli_inst_handle, command_group);
  EFM_ASSERT(status);
  OSTimeDly( 10,              /*   Delay the task for 100 OS Ticks.         */
               OS_OPT_TIME_DLY,  /*   Delay is relative to current time.       */
              &err);
  if(sl_cli_get_argument_string(arguments,0)!= NULL){
      tmp_flag_pr =1;

      char* tmp_cmd = sl_cli_get_argument_string(arguments,0);
      if(strcmp(tmp_cmd,"ls")==0){
          sl_cli_command_arg_t args;
          args.handle = sl_cli_inst_handle;
          if(sl_cli_get_argument_count(arguments)==2){
              args.argc = 2;
              args.argv = malloc(args.argc * sizeof(void*));
              args.argv[0] = "ls";
              args.argv[1] = sl_cli_get_argument_string(arguments,1);
              args.arg_ofs = 1;
          }else if(sl_cli_get_argument_count(arguments)==3){
              args.argc = 3;
              args.argv = malloc(args.argc * sizeof(void*));
              args.argv[0] = "ls";
              args.argv[1] = sl_cli_get_argument_string(arguments,1);
              args.argv[2] = sl_cli_get_argument_string(arguments,2);
              args.arg_ofs = 1;
          }else{
              args.argc = 1;
              args.argv = malloc(args.argc * sizeof(void*));
              args.argv[0] = "ls";
              args.arg_ofs = 1;
          }
          ls_cmd(&args);

      }else if(strcmp(tmp_cmd,"cp")==0){
          sl_cli_command_arg_t args;
          args.handle = sl_cli_inst_handle;
          args.argc = 3;
          args.argv = malloc(args.argc * sizeof(void*));
          args.argv[0] = "cp";
          args.argv[1] = sl_cli_get_argument_string(arguments,1);
          args.argv[2] = sl_cli_get_argument_string(arguments,2);
          args.arg_ofs = 1;
          cp_cmd(&args);
      }else if(strcmp(tmp_cmd,"mv")==0){
          sl_cli_command_arg_t args;
          args.handle = sl_cli_inst_handle;
          args.argc = 3;
          args.argv = malloc(args.argc * sizeof(void*));
          args.argv[0] = "mv";
          args.argv[1] = sl_cli_get_argument_string(arguments,1);
          args.argv[2] = sl_cli_get_argument_string(arguments,2);
          args.arg_ofs = 1;
          mv_cmd(&args);
      }else if(strcmp(tmp_cmd,"rm")==0){
          sl_cli_command_arg_t args;
          args.handle = sl_cli_inst_handle;
          args.argc = 2;
          args.argv = malloc(args.argc * sizeof(void*));
          args.argv[0] = "rm";
          args.argv[1] = sl_cli_get_argument_string(arguments,1);
          args.arg_ofs = 1;
          rm_cmd(&args);
      }else if(strcmp(tmp_cmd,"mkdir")==0){
          sl_cli_command_arg_t args;
          args.handle = sl_cli_inst_handle;
          args.argc = 2;
          args.argv = malloc(args.argc * sizeof(void*));
          args.argv[0] = "mkdir";
          args.argv[1] = sl_cli_get_argument_string(arguments,1);
          args.arg_ofs = 1;
          mk_dir(&args);
      }
      else{
          tmp_flag_pr =0;

      }

  }
  if(testing_flag==0&&tmp_flag_pr!=1){
      printf("SD");
  }

}
void exit_sd(){
  bool status;

  status = sl_cli_command_add_command_group(sl_cli_inst_handle, command_group);
  EFM_ASSERT(status);

  status = sl_cli_command_remove_command_group(sl_cli_inst_handle, sd_group);
  EFM_ASSERT(status);
  fs_unmount_f();
  printf("BASE");

