Runhui-Wang/EFM32GG11_FileSys/file_system_upgrade/cli.c
}

void cd_cmd(sl_cli_command_arg_t *arguments){

  char* pathc = sl_cli_get_argument_string(arguments,0);

  fs_cd_cmd_f(pathc);
}

void pwd_cmd(){
  fs_pwd_cmd_f();
}
void
file_setup (void)
{
  int num_write = 0;
  unsigned int nwritten = 0;
  char header_txt[25] = "I don't know the format.\n";
  int write_request_bytes = 0;
  int read_request_bytes = 24;
  int total_bytes_written = 0;
  unsigned int write_bytes_written = 0;
  unsigned int read_bytes_recieved = 0;

  //create testfile on sd card and write a test string
  if(file_num==0){
        retval = f_open (&superfile, file_name,
          FA_CREATE_ALWAYS | FA_WRITE | FA_READ);
  }else{
      retval = f_open (&superfile, file_name,
                       FA_OPEN_APPEND | FA_WRITE | FA_READ);
  }

  if (retval != FR_OK)
    {
      printf ("Failed to open %s, error %u\n", file_name, retval);
    }

  retval = f_close (&superfile);
  if (retval != FR_OK)
    {
      printf ("Failed to close %s, error %u\n", file_name, retval);
    }

  //closing and reopening is taxing- but we'd like to write to the file without overwriting
  //each data entry. opening in FA_OPEN_APPEND lets us write multiple lines to the file
  retval = f_open (&superfile, file_name, FA_OPEN_APPEND | FA_WRITE | FA_READ);
  if (retval != FR_OK)
    {
      printf ("Failed to open %s, error %u\n", file_name, retval);
    }

  return;
}

void
app_iostream_usart_init (void)
{
  RTOS_ERR err;

  /* Prevent buffering of output/input.*/
#if !defined(__CROSSWORKS_ARM) && defined(__GNUC__)
  setvbuf (stdout, NULL, _IONBF, 0); /*Set unbuffered mode for stdout (newlib)*/
  setvbuf (stdin, NULL, _IONBF, 0); /*Set unbuffered mode for stdin (newlib)*/
#endif
  fs_bsp_init (); //SD Card Set-up
  file_setup (); // First file initialization

  // Enable ADC0 clock
  CMU_ClockEnable (cmuClock_ADC0, true);
  CMU_ClockSelectSet (cmuClock_LFE, cmuSelect_LFRCO);
  CMU_ClockEnable (cmuClock_RTCC, true);
  // Declare init structs
  ADC_Init_TypeDef init = ADC_INIT_DEFAULT;
  ADC_InitSingle_TypeDef initSingle = ADC_INITSINGLE_DEFAULT;

  // Modify init structs and initialize
  init.prescale = ADC_PrescaleCalc (adcFreq, 0); // Init to max ADC clock for Series 1

  initSingle.diff = false;        // single ended
  initSingle.reference = adcRef2V5;    // internal 2.5V reference
  initSingle.resolution = adcRes12Bit;  // 12-bit resolution
  initSingle.acqTime = adcAcqTime4; // set acquisition time to meet minimum requirement

  // Expansion Header Pin #6
  initSingle.posSel = adcPosSelAPORT4XCH11;
  init.timebase = ADC_TimebaseCalc (0);

  //Initialize ADC
  ADC_Init (ADC0, &init);
  ADC_InitSingle (ADC0, &initSingle);

  //Add task to system
  OSTaskCreate (&tcb, "iostream terminal task", app_iostream_terminal_task,
  DEF_NULL,
                TERMINAL_TASK_PRIO, &stack[0], (TERMINAL_TASK_STACK_SIZE / 10u),
                TERMINAL_TASK_STACK_SIZE,
                0u, 0u,
                DEF_NULL,
                (OS_OPT_TASK_STK_CLR ), &err);
  EFM_ASSERT((RTOS_ERR_CODE_GET(err) == RTOS_ERR_NONE));
}
static void
on_periodic_timeout (sl_sleeptimer_timer_handle_t *handle, void *data)
{
  if (front == 160)
    {
      front = 0;
    }
  (void) &handle;
  (void) &data;
  reach_flag = 1;
  ADC_Start (ADC0, adcStartSingle);
  while (!(ADC0->STATUS & _ADC_STATUS_SINGLEDV_MASK))
    ;
  sample = ADC_DataSingleGet (ADC0);
  // Calculate input voltage in mV
  millivolts = (sample * 2500) / 4096;
  tick_cnt = sl_sleeptimer_get_tick_count64 ();
  stat = sl_sleeptimer_tick64_to_ms (tick_cnt, &timestamp);
  uint64_t new_t = timestamp + time_offset * 1000;
  (cirbuff + front)->t_stamp = new_t;
  (cirbuff + front)->voltage = millivolts;
  front++;


}
void
app_iostream_terminal_task (void *arg)
{

  RTOS_ERR err;
  //Set default iostream to be expansion header 12,14
  //Start the periodic timer of 200 ms. Trigger timeout callback function.
  sl_sleeptimer_start_periodic_timer_ms (
      &periodic_timer,
      TIMEOUT_MS,
      on_periodic_timeout, NULL, 0,
      0);
  char* output =  malloc(512*sizeof output);

  while (true)
    {
      uint64_t new_t;
      uint32_t millivolt;
      if (back == 160)
        {
          //check whether reached end of cirbuff
          //return to beginning if reached
          back = 0;
        }

      while (true)
        {
          if(back==front){
              OSTimeDly( 1,
                         OS_OPT_TIME_DLY,
                         &err);
          }
          else{
              //if there is no new data.
              /**OSTimeDly( 1,
               OS_OPT_TIME_DLY,
               &err);**/
              new_t = (cirbuff + back)->t_stamp;
              millivolt = (cirbuff + back)->voltage;
              //divide the 64 bit int to two to correctly print
              uint32_t first_t, second_t;
              first_t = (uint32_t) (new_t >> 32);
              second_t = (uint32_t) new_t;
              snprintf (output + ((back %16) * 32), 34, "Time: %08x%08x mV: %04d\n", first_t,
                        second_t, millivolt);
              back++;
          }

          if(back!=0&&back%16==0){
              break;
          }

        }

      //read from circular buffer

      //divide the 64 bit int to two to correctly print
      uint32_t first_t, second_t;
      first_t = (uint32_t) (new_t >> 32);
      second_t = (uint32_t) new_t;
      //write to the string to be used for SD card write
      //print to iostream
     printf ("Time: %08x%08x mV: %04d\n", first_t, second_t, millivolts);
      if (data_entries+160 >= 32000)
        {
          //if a file has 30000 data entries, close that and initialize a new one
          testing_flag=0;
          f_close (&superfile);
          file_num++;

          snprintf (file_name, 18, "ADC_Data_%04d.txt", file_num);
          retval = f_open (&superfile, file_name,
          FA_CREATE_ALWAYS | FA_WRITE | FA_READ);
          data_entries = 0;
          retval = f_open (&superfile, file_name,
          FA_OPEN_APPEND | FA_WRITE | FA_READ);

