Runhui-Wang/EFM32GG11_FileSys/file_system_upgrade/cli.c
        }
      else
        {
          data_entries+=16;
          //if there is still space, open the file to append at the  end


        }
      if (retval != FR_OK)
        {
          printf ("Failed to open %s, error %u\n", file_name, retval);
        }
      //write the string to file

      write_request_bytes = 512;

          retval = f_write (&superfile, output, write_request_bytes,
                            &write_bytes_written);



      if (retval != FR_OK)
        {
          printf ("Failed to write %s, error %u\n", file_name, retval);
        }

    }

}
void adc_cmd (sl_cli_command_arg_t *arguments){
  uint64_t argument_value;
    RTOS_ERR err;
    // Read all the arguments provided as integers and print them back

    argument_value = (uint64_t) sl_cli_get_argument_int32(arguments, 0);

    time_offset = argument_value;
    GPIO_PinModeSet (gpioPortE, 9, gpioModeInput, 0);    // RX
    //init the cirbuff, able to hold 20 struct adc_data
    cirbuff = malloc (160 * sizeof *cirbuff);
    app_iostream_usart_init ();
}
void pause_cmd(){
  RTOS_ERR err;
 // f_close (&superfile);
  OSTaskDel(&tcb,&err);
  printf("Tensionmeter Paused!\n");
}
void cp_cmd(sl_cli_command_arg_t *arguments){
  char* n_name;
  char* o_name;
  n_name =  sl_cli_get_argument_string(arguments,1);
  o_name = sl_cli_get_argument_string(arguments,0);
  fs_cp_cmd_f(o_name,n_name);
  if(testing_flag==0){
      printf("SD");
  }
}
void test_ls_cmd(void) {
  uint64_t temptime, ms_n;

    sl_cli_command_arg_t args;
    args.handle = sl_cli_inst_handle;
    args.argc = 0;
    args.argv = malloc(args.argc * sizeof(void*));
    args.argv[0] = "ls";
    args.arg_ofs = 0;

    temptime = sl_sleeptimer_get_tick_count64();

    ls_cmd(&args);
    uint64_t mkdirtime = sl_sleeptimer_get_tick_count64()-temptime;
        sl_sleeptimer_tick64_to_ms(mkdirtime, &ms_n);
        printf("Time for ls: %d\n", (uint32_t)ms_n);
    // Check the results
    // ...

}

void test_mk_dir(void) {
  uint64_t temptime, ms_n;

    sl_cli_command_arg_t args;
    args.handle = sl_cli_inst_handle;
    args.argc = 2;
    args.argv = malloc(args.argc * sizeof(void*));
    args.argv[0] = "mkdir";
    args.argv[1] = "aaad";
    args.arg_ofs = 1;

    temptime = sl_sleeptimer_get_tick_count64();

    mk_dir(&args);
    uint64_t mkdirtime = sl_sleeptimer_get_tick_count64()-temptime;
        sl_sleeptimer_tick64_to_ms(mkdirtime, &ms_n);
        printf("Time for mkdir: %d\n", (uint32_t)ms_n);
    // Check the results
    // ...

}

void test_rm_cmd(void) {
  uint64_t temptime, ms_n;

    sl_cli_command_arg_t args;
    args.handle = sl_cli_inst_handle;
    args.argc = 2;
    args.argv = malloc(args.argc * sizeof(void*));
    args.argv[0] = "rm";
    args.argv[1] = "aaad";
    args.arg_ofs = 1;

    temptime = sl_sleeptimer_get_tick_count64();

    rm_cmd(&args);
    uint64_t mkdirtime = sl_sleeptimer_get_tick_count64()-temptime;
        sl_sleeptimer_tick64_to_ms(mkdirtime, &ms_n);
        printf("Time for rm: %d\n", (uint32_t)ms_n);
    // Check the results
    // ...

}

void test_mv_cmd(void) {
  uint64_t temptime, ms_n;

    sl_cli_command_arg_t args;
    args.handle = sl_cli_inst_handle;
    args.argc = 3;
    args.argv = malloc(args.argc * sizeof(void*));
    args.argv[0] = "mv";
    args.argv[1] = "aaad";
    args.argv[2] = "aas";
    args.arg_ofs = 1;

    temptime = sl_sleeptimer_get_tick_count64();

    mv_cmd(&args);
    uint64_t mkdirtime = sl_sleeptimer_get_tick_count64()-temptime;
        sl_sleeptimer_tick64_to_ms(mkdirtime, &ms_n);
        printf("Time for mv: %d\n", (uint32_t)ms_n);
    // Check the results
    // ...

}

void test_cd_cmd(void) {
    uint64_t temptime, ms_n;

    sl_cli_command_arg_t args;
    args.handle = sl_cli_inst_handle;
    args.argc = 2;
    args.argv = malloc(args.argc * sizeof(void*));
    args.argv[0] = "cd";
    args.argv[1] = "aas";
    args.arg_ofs = 1;
    args.arg_type_list = malloc((args.argc -1) * sizeof(sl_cli_argument_type_t));

    temptime = sl_sleeptimer_get_tick_count64();

    cd_cmd(&args);
    uint64_t mkdirtime = sl_sleeptimer_get_tick_count64()-temptime;
    sl_sleeptimer_tick64_to_ms(mkdirtime, &ms_n);
    printf("Time for cd: %d\n", (uint32_t)ms_n);
    // Check the results
    // ...

}

void test_pwd_cmd(void) {
    sl_cli_command_arg_t args;
    args.handle = sl_cli_inst_handle;
    args.argc = 1;
    args.argv = malloc(args.argc * sizeof(void*));
    args.argv[0] = "pwd";
    args.arg_ofs = 0;

    pwd_cmd(&args);

    // Check the results
    // ...

}

void test_wr_cmd(void){
  uint64_t temptime, ms_n;

  uint32_t br,bw;
  FRESULT fr;
  char dst[] = "test.txt";
  fr = f_open(&superfile, dst, FA_CREATE_ALWAYS | FA_WRITE);
  char str[512] = {0};

  temptime = sl_sleeptimer_get_tick_count64();

  fr = f_write(&superfile,str,512,&bw);

  uint64_t mkdirtime = sl_sleeptimer_get_tick_count64()-temptime;
  sl_sleeptimer_tick64_to_ms(mkdirtime, &ms_n);
  printf("Time for write: %d\n", (uint32_t)ms_n);
  f_close(&superfile);
  fr = f_open(&superfile, dst, FA_READ);

  temptime = sl_sleeptimer_get_tick_count64();

  fr = f_read(&superfile,str,512,&bw);

   mkdirtime = sl_sleeptimer_get_tick_count64()-temptime;
  sl_sleeptimer_tick64_to_ms(mkdirtime, &ms_n);
  f_close(&superfile);

  printf("Time for read: %d\n", (uint32_t)ms_n);
}

void clean_tests(){

    sl_cli_command_arg_t args;
    args.handle = sl_cli_inst_handle;
    args.argc = 2;
    args.argv = malloc(args.argc * sizeof(void*));
    args.argv[0] = "rm";
    args.argv[1] = "test.txt";
    args.arg_ofs = 1;
    rm_cmd(&args);

      args.handle = sl_cli_inst_handle;
      args.argc = 2;
      args.argv = malloc(args.argc * sizeof(void*));
      args.argv[0] = "rm";
      args.argv[1] = "test_new.txt";
      args.arg_ofs = 1;

    rm_cmd(&args);
    args.handle = sl_cli_inst_handle;
    args.argc = 2;
    args.argv = malloc(args.argc * sizeof(void*));
    args.argv[0] = "cd";
    args.argv[1] = "/";
    args.arg_ofs = 1;
    args.arg_type_list = malloc((args.argc -1) * sizeof(sl_cli_argument_type_t));


