Runhui-Wang/EFM32GG11_FileSys/file_system_upgrade/cli.c
    cd_cmd(&args);


      args.handle = sl_cli_inst_handle;
      args.argc = 2;
      args.argv = malloc(args.argc * sizeof(void*));
      args.argv[0] = "rm";
      args.argv[1] = "aaa";
      args.arg_ofs = 1;


      rm_cmd(&args);


        args.handle = sl_cli_inst_handle;
        args.argc = 2;
        args.argv = malloc(args.argc * sizeof(void*));
        args.argv[0] = "rm";
        args.argv[1] = "aas";
        args.arg_ofs = 1;


        rm_cmd(&args);

}
void test_cp_cmd (){
  sl_cli_command_arg_t args;
  uint64_t temptime, ms_n;

  args.handle = sl_cli_inst_handle;
  args.argc = 3;
  args.argv = malloc(args.argc * sizeof(void*));
  args.argv[0] = "cp";
  args.argv[1] = "test.txt";
  args.argv[2] = "test_new_new.txt";

  args.arg_ofs = 1;
  temptime = sl_sleeptimer_get_tick_count64();

  cp_cmd(&args);
  uint64_t mkdirtime = sl_sleeptimer_get_tick_count64()-temptime;
 sl_sleeptimer_tick64_to_ms(mkdirtime, &ms_n);
 printf("Time for copy: %d\n", (uint32_t)ms_n);

}
void unit_test(){
  printf("Testing All Functionalities... Avoid Name: aaad, aas, aaa to be used!\n");
  testing_flag=1;
  sl_cli_command_arg_t args;
      args.handle = sl_cli_inst_handle;
      args.argc =1;
      args.argv = malloc(args.argc * sizeof(void*));
      args.argv[0] = "sd";
      args.arg_ofs = 1;

  enable_sd(&args);
/**
  sl_cli_command_arg_t args;
      args.handle = sl_cli_inst_handle;
      args.argc = 2;
      args.argv = malloc(args.argc * sizeof(void*));
      args.argv[0] = "mkdir";
      args.argv[1] = "aaa";
      args.arg_ofs = 1;
      mk_dir(&args);

  test_mk_dir();
  test_ls_cmd();
  test_mv_cmd();
  test_ls_cmd();
  test_mk_dir();
  test_ls_cmd();
  test_rm_cmd();
  test_ls_cmd();
  test_cd_cmd();
  test_ls_cmd();
  test_wr_cmd();**/
  test_cp_cmd();
  //clean_tests();
  printf("Verify result by yourself! Break point if needed!\n");
  printf("Tests completed.\n");
  testing_flag=0;
}


/*******************************************************************************
 **************************   GLOBAL FUNCTIONS   *******************************
 ******************************************************************************/

/*******************************************************************************
 * Initialize cli example.
 ******************************************************************************/
void cli_app_init(void)
{
  bool status;
  status = sl_cli_command_add_command_group(sl_cli_inst_handle, command_group);
  EFM_ASSERT(status);
  CMU_ClockSelectSet(cmuClock_LFE, cmuSelect_LFRCO);
  CMU_ClockEnable(cmuClock_RTCC, true);
  sl_status_t  status_sl = sl_sleeptimer_init();
    if(status_sl != SL_STATUS_OK) {
      printf("Sleeptimer init error.\r\n");
    }
  printf("\r\nStarted CLI Bootload Example\r\n\r\n");
  printf("BASE");


  //printf("size of buffer: %d\n",sizeof buffer_t);


}
